# SQL Data Analysis Workshop

 This workshop is designed to help you build practical SQL skills by analyzing real-world business data. 
     
The tasks are divided into 4 levels to gradually progress from basic data retrieval to advanced analysis. Each level focuses on specific SQL concepts and challenges, allowing you to practice query writing, data filtering, aggregations, joins, and subqueries.
- Level 1: Basic SQL queries (SELECT, WHERE, ORDER BY, COUNT).
- Level 2: Aggregations (SUM, AVG, GROUP BY) and basic joins.
- Level 3: Complex joins, subqueries, and multi-table analysis.
- Level 4: Advanced analytical tasks focused on complex queries, subqueries, and aggregations..

This structured approach ensures you build confidence and expertise in SQL, preparing you for real-world data analysis challenges. ðŸš€

---
## Setup the work environment

#### 1. Library's import

In [1]:
#Improts 
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

#### 2. Connecting to the Database

In [2]:
import mysql.connector

# Establish the connection
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="302112",
    database="bike_1"
)

# Create a cursor object
cursor = connection.cursor()
print("Connection established successfully.")

Connection established successfully.

#### 3. Setup for SQL Magic

In [3]:
%load_ext sql

In [ ]:
!pip install ipython-sql

In [4]:
%sql mysql+mysqlconnector://root:302112@localhost:3306/bike_1

Connecting to 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'


---
## Level 1: Beginner â€“ Basic Queries (using SQL Magic)

### Task 1: Retrieve all rows and columns from the customers table.

In [125]:
%%sql 
SELECT * 
FROM customers;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1445 rows affected.

+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
| customer_id | first_name | last_name |     phone      |           email            |          street         |       city      | state | zip_code |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
|      1      |   Debra    |   Burks   |      None      |   debra.burks@yahoo.com    |    9273 Thorne Ave.     |   Orchard Park  |   NY  |  14127   |
|      2      |   Kasha    |    Todd   |      None      |    kasha.todd@yahoo.com    |     910 Vine Street     |     Campbell    |   CA  |  95008   |
|      3      |   Tameka   |   Fisher  |      None      |   tameka.fisher@aol.com    |  769C Honey Creek St.   |  Redondo Beach  |   CA  |  90278   |
|      4      |   Daryl    |   Spence  |      None      |    daryl.spence@aol.com    |     988 Pearl Lane      |    Uniondale    |   NY  |  11553   |
|      5      | Charolette |    Rice   | (916) 381-6003 |  charolette.rice@msn.com   |      107 River Dr.      |    Sacramento   |   CA  |  95820   |
|      6      |  Lyndsey   |    Bean   |      None      |  lyndsey.bean@hotmail.com  |      769 West Road      |     Fairport    |   NY  |  14450   |
|      7      |  Latasha   |    Hays   | (716) 986-3359 |  latasha.hays@hotmail.com  | 7014 Manor Station Rd.  |     Buffalo     |   NY  |  14215   |
|      8      | Jacquline  |   Duncan  |      None      | jacquline.duncan@yahoo.com |      15 Brown St.       | Jackson Heights |   NY  |  11372   |
|      9      |  Genoveva  |  Baldwin  |      None      |  genoveva.baldwin@msn.com  |    8550 Spruce Drive    | Port Washington |   NY  |  11050   |
|      10     |  Pamelia   |   Newman  |      None      |  pamelia.newman@gmail.com  |    476 Chestnut Ave.    |      Monroe     |   NY  |  10950   |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
Truncated to displaylimit of 10.

### Task 2: Retrieve customers who live in the city "New York".

In [126]:
%%sql

SELECT * 
FROM customers
WHERE city = 'New York';

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

7 rows affected.

+-------------+------------+-----------+----------------+----------------------------+---------------------------+----------+-------+----------+
| customer_id | first_name | last_name |     phone      |           email            |           street          |   city   | state | zip_code |
+-------------+------------+-----------+----------------+----------------------------+---------------------------+----------+-------+----------+
|      16     |   Emmitt   |  Sanchez  | (212) 945-8823 | emmitt.sanchez@hotmail.com |   461 Squaw Creek Road    | New York |   NY  |  10002   |
|     178     |  Genoveva  |   Tyler   | (212) 152-6381 |  genoveva.tyler@gmail.com  |    8121 Windfall Ave.     | New York |   NY  |  10002   |
|     327     |   Sharie   |  Alvarez  | (212) 211-7621 |   sharie.alvarez@msn.com   | 987 West Leatherwood Dr.  | New York |   NY  |  10002   |
|     411     |  Octavia   |    Case   | (212) 171-1335 |    octavia.case@aol.com    |      40 Charles Road      | New York |   NY  |  10002   |
|     854     |   Phylis   |   Adkins  | (212) 325-9145 |   phylis.adkins@msn.com    |      7781 James Ave.      | New York |   NY  |  10002   |
|     927     | Guillermo  |    Hart   | (212) 652-7198 | guillermo.hart@hotmail.com |  81 Indian Summer Drive   | New York |   NY  |  10002   |
|     1016    |   Shenna   |   Benton  | (212) 578-2912 |   shenna.benton@msn.com    |   57 Shadow Brook Road    | New York |   NY  |  10002   |
+-------------+------------+-----------+----------------+----------------------------+---------------------------+----------+-------+----------+

### Task 3: Retrieve all products sorted by their price in descending order.

In [127]:
%%sql

SELECT * 
FROM products
ORDER BY list_price DESC;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

321 rows affected.

+------------+----------------------------------------+----------+-------------+------------+------------+
| product_id |              product_name              | brand_id | category_id | model_year | list_price |
+------------+----------------------------------------+----------+-------------+------------+------------+
|    155     |     Trek Domane SLR 9 Disc - 2018      |    9     |      7      |    2018    |  11999.99  |
|    149     |     Trek Domane SLR 8 Disc - 2018      |    9     |      7      |    2018    |  7499.99   |
|     51     |    Trek Silque SLR 8 Women's - 2017    |    9     |      7      |    2017    |  6499.99   |
|    156     |     Trek Domane SL Frameset - 2018     |    9     |      7      |    2018    |  6499.99   |
|    157     | Trek Domane SL Frameset Women's - 2018 |    9     |      7      |    2018    |  6499.99   |
|    169     |        Trek Emonda SLR 8 - 2018        |    9     |      7      |    2018    |  6499.99   |
|     50     |    Trek Silque SLR 7 Women's - 2017    |    9     |      7      |    2017    |  5999.99   |
|     56     |     Trek Domane SLR 6 Disc - 2017      |    9     |      7      |    2017    |  5499.99   |
|    148     |      Trek Domane SL 8 Disc - 2018      |    9     |      7      |    2018    |  5499.99   |
|    154     | Trek Domane SLR 6 Disc Women's - 2018  |    9     |      7      |    2018    |  5499.99   |
+------------+----------------------------------------+----------+-------------+------------+------------+
Truncated to displaylimit of 10.

### Task 4: Find Orders by Status

#### Task 4.1: Retrieve all orders with status "Completed".

In [128]:
%%sql # ?????????????????????????????????????
  
SELECT * 
FROM orders
#WHERE order_status = 'Completed';

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1615 rows affected.

+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
| order_id | customer_id | order_status | order_date | required_date | shipped_date | store_id | staff_id |
+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
|    1     |     259     |      4       | 2016-01-01 |   2016-01-03  |  2016-01-03  |    1     |    2     |
|    2     |     1212    |      4       | 2016-01-01 |   2016-01-04  |  2016-01-03  |    2     |    6     |
|    3     |     523     |      4       | 2016-01-02 |   2016-01-05  |  2016-01-03  |    2     |    7     |
|    4     |     175     |      4       | 2016-01-03 |   2016-01-04  |  2016-01-05  |    1     |    3     |
|    5     |     1324    |      4       | 2016-01-03 |   2016-01-06  |  2016-01-06  |    2     |    6     |
|    6     |      94     |      4       | 2016-01-04 |   2016-01-07  |  2016-01-05  |    2     |    6     |
|    7     |     324     |      4       | 2016-01-04 |   2016-01-07  |  2016-01-05  |    2     |    6     |
|    8     |     1204    |      4       | 2016-01-04 |   2016-01-05  |  2016-01-05  |    2     |    7     |
|    9     |      60     |      4       | 2016-01-05 |   2016-01-08  |  2016-01-08  |    1     |    2     |
|    10    |     442     |      4       | 2016-01-05 |   2016-01-06  |  2016-01-06  |    2     |    6     |
+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
Truncated to displaylimit of 10.

#### Task 4.1: Retrieve count of orders with status "Rejected".

In [14]:
%%sql # ?????????????????????????????????????
  
SELECT * 
FROM orders
#WHERE order_status = 'Completed';

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1615 rows affected.

+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
| order_id | customer_id | order_status | order_date | required_date | shipped_date | store_id | staff_id |
+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
|    1     |     259     |      4       | 2016-01-01 |   2016-01-03  |  2016-01-03  |    1     |    2     |
|    2     |     1212    |      4       | 2016-01-01 |   2016-01-04  |  2016-01-03  |    2     |    6     |
|    3     |     523     |      4       | 2016-01-02 |   2016-01-05  |  2016-01-03  |    2     |    7     |
|    4     |     175     |      4       | 2016-01-03 |   2016-01-04  |  2016-01-05  |    1     |    3     |
|    5     |     1324    |      4       | 2016-01-03 |   2016-01-06  |  2016-01-06  |    2     |    6     |
|    6     |      94     |      4       | 2016-01-04 |   2016-01-07  |  2016-01-05  |    2     |    6     |
|    7     |     324     |      4       | 2016-01-04 |   2016-01-07  |  2016-01-05  |    2     |    6     |
|    8     |     1204    |      4       | 2016-01-04 |   2016-01-05  |  2016-01-05  |    2     |    7     |
|    9     |      60     |      4       | 2016-01-05 |   2016-01-08  |  2016-01-08  |    1     |    2     |
|    10    |     442     |      4       | 2016-01-05 |   2016-01-06  |  2016-01-06  |    2     |    6     |
+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
Truncated to displaylimit of 10.

### Task 5: Count how many customers exist in the customers table.

In [129]:
%%sql
 
SELECT COUNT(*) AS total_customers
FROM customers;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1 rows affected.

+-----------------+
| total_customers |
+-----------------+
|       1445      |
+-----------------+

---
## Level 2: Intermediate â€“ Aggregations and Basic Joins
##### (Task 1,2,3 using Pandas read_sql and Task 4,5 using execute and fetchall() in mysql.connector)

### Task 1: Calculate the total revenue (sum of list_price * quantity) from the order_items table.

In [31]:
%%sql  
SELECT SUM(quantity * list_price) AS total_revenue
FROM order_items;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1 rows affected.

+---------------+
| total_revenue |
+---------------+
|   8578988.88  |
+---------------+

### Task 2: Calculate the average price of products in the products table.

In [130]:
%%sql
      
SELECT AVG(list_price) AS Average_price
FROM products;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1 rows affected.

+---------------+
| Average_price |
+---------------+
|  1520.591402  |
+---------------+

### Task 3: Retrieve the number of orders placed by each customer.

In [131]:
%%sql
SELECT customer_id,COUNT(order_id) AS total_orders
FROM Orders
GROUP BY customer_id;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1445 rows affected.

+-------------+--------------+
| customer_id | total_orders |
+-------------+--------------+
|      1      |      3       |
|      2      |      3       |
|      3      |      3       |
|      4      |      3       |
|      5      |      3       |
|      6      |      3       |
|      7      |      3       |
|      8      |      3       |
|      9      |      3       |
|      10     |      3       |
+-------------+--------------+
Truncated to displaylimit of 10.

### Task 4: Join Orders with Customers

#### Task 4.1: Retrieve customer names along with their order IDs.

In [132]:
%%sql
      
SELECT c.first_name, c.last_name, o.order_id
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1615 rows affected.

+------------+-----------+----------+
| first_name | last_name | order_id |
+------------+-----------+----------+
|   Debra    |   Burks   |   599    |
|   Debra    |   Burks   |   1555   |
|   Debra    |   Burks   |   1613   |
|   Kasha    |    Todd   |   692    |
|   Kasha    |    Todd   |   1084   |
|   Kasha    |    Todd   |   1509   |
|   Tameka   |   Fisher  |   1468   |
|   Tameka   |   Fisher  |   1496   |
|   Tameka   |   Fisher  |   1612   |
|   Daryl    |   Spence  |   700    |
+------------+-----------+----------+
Truncated to displaylimit of 10.

#### Task 4.2: Retrieve Customer Names with Total Orders

In [44]:
%%sql
select * From customers

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1445 rows affected.

+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
| customer_id | first_name | last_name |     phone      |           email            |          street         |       city      | state | zip_code |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
|      1      |   Debra    |   Burks   |      None      |   debra.burks@yahoo.com    |    9273 Thorne Ave.     |   Orchard Park  |   NY  |  14127   |
|      2      |   Kasha    |    Todd   |      None      |    kasha.todd@yahoo.com    |     910 Vine Street     |     Campbell    |   CA  |  95008   |
|      3      |   Tameka   |   Fisher  |      None      |   tameka.fisher@aol.com    |  769C Honey Creek St.   |  Redondo Beach  |   CA  |  90278   |
|      4      |   Daryl    |   Spence  |      None      |    daryl.spence@aol.com    |     988 Pearl Lane      |    Uniondale    |   NY  |  11553   |
|      5      | Charolette |    Rice   | (916) 381-6003 |  charolette.rice@msn.com   |      107 River Dr.      |    Sacramento   |   CA  |  95820   |
|      6      |  Lyndsey   |    Bean   |      None      |  lyndsey.bean@hotmail.com  |      769 West Road      |     Fairport    |   NY  |  14450   |
|      7      |  Latasha   |    Hays   | (716) 986-3359 |  latasha.hays@hotmail.com  | 7014 Manor Station Rd.  |     Buffalo     |   NY  |  14215   |
|      8      | Jacquline  |   Duncan  |      None      | jacquline.duncan@yahoo.com |      15 Brown St.       | Jackson Heights |   NY  |  11372   |
|      9      |  Genoveva  |  Baldwin  |      None      |  genoveva.baldwin@msn.com  |    8550 Spruce Drive    | Port Washington |   NY  |  11050   |
|      10     |  Pamelia   |   Newman  |      None      |  pamelia.newman@gmail.com  |    476 Chestnut Ave.    |      Monroe     |   NY  |  10950   |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
Truncated to displaylimit of 10.

In [45]:
%%sql
select * From orders

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1615 rows affected.

+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
| order_id | customer_id | order_status | order_date | required_date | shipped_date | store_id | staff_id |
+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
|    1     |     259     |      4       | 2016-01-01 |   2016-01-03  |  2016-01-03  |    1     |    2     |
|    2     |     1212    |      4       | 2016-01-01 |   2016-01-04  |  2016-01-03  |    2     |    6     |
|    3     |     523     |      4       | 2016-01-02 |   2016-01-05  |  2016-01-03  |    2     |    7     |
|    4     |     175     |      4       | 2016-01-03 |   2016-01-04  |  2016-01-05  |    1     |    3     |
|    5     |     1324    |      4       | 2016-01-03 |   2016-01-06  |  2016-01-06  |    2     |    6     |
|    6     |      94     |      4       | 2016-01-04 |   2016-01-07  |  2016-01-05  |    2     |    6     |
|    7     |     324     |      4       | 2016-01-04 |   2016-01-07  |  2016-01-05  |    2     |    6     |
|    8     |     1204    |      4       | 2016-01-04 |   2016-01-05  |  2016-01-05  |    2     |    7     |
|    9     |      60     |      4       | 2016-01-05 |   2016-01-08  |  2016-01-08  |    1     |    2     |
|    10    |     442     |      4       | 2016-01-05 |   2016-01-06  |  2016-01-06  |    2     |    6     |
+----------+-------------+--------------+------------+---------------+--------------+----------+----------+
Truncated to displaylimit of 10.

In [133]:
%%sql 

select c.first_name, c.last_name, COUNT(o.order_id) AS total_orders
From customers c
join orders o ON c.customer_id = o.customer_id
GROUP BY c.first_name, c.last_name;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1444 rows affected.

+------------+-----------+--------------+
| first_name | last_name | total_orders |
+------------+-----------+--------------+
|   Debra    |   Burks   |      3       |
|   Kasha    |    Todd   |      3       |
|   Tameka   |   Fisher  |      3       |
|   Daryl    |   Spence  |      3       |
| Charolette |    Rice   |      3       |
|  Lyndsey   |    Bean   |      3       |
|  Latasha   |    Hays   |      3       |
| Jacquline  |   Duncan  |      3       |
|  Genoveva  |  Baldwin  |      3       |
|  Pamelia   |   Newman  |      3       |
+------------+-----------+--------------+
Truncated to displaylimit of 10.

### Task 5: Retrieve products with stock quantities less than 50.

In [60]:
%%sql
select * from stocks

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

939 rows affected.

+----------+------------+----------+
| store_id | product_id | quantity |
+----------+------------+----------+
|    1     |     1      |    27    |
|    1     |     2      |    5     |
|    1     |     3      |    6     |
|    1     |     4      |    23    |
|    1     |     5      |    22    |
|    1     |     6      |    0     |
|    1     |     7      |    8     |
|    1     |     8      |    0     |
|    1     |     9      |    11    |
|    1     |     10     |    15    |
+----------+------------+----------+
Truncated to displaylimit of 10.

In [134]:
%%sql
    
SELECT product_id ,quantity
FROM stocks
WHERE quantity < 50;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

939 rows affected.

+------------+----------+
| product_id | quantity |
+------------+----------+
|     1      |    27    |
|     2      |    5     |
|     3      |    6     |
|     4      |    23    |
|     5      |    22    |
|     6      |    0     |
|     7      |    8     |
|     8      |    0     |
|     9      |    11    |
|     10     |    15    |
+------------+----------+
Truncated to displaylimit of 10.

---

## Level 3: Advanced â€“ Complex Joins and Subqueries
(using Pandas read_sql)

### Task 1: Retrieve the Top 5 Products with the Highest Total Sales Revenue

In [63]:
%%sql
select * from products

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

321 rows affected.

+------------+---------------------------------------+----------+-------------+------------+------------+
| product_id |              product_name             | brand_id | category_id | model_year | list_price |
+------------+---------------------------------------+----------+-------------+------------+------------+
|     1      |            Trek 820 - 2016            |    9     |      6      |    2016    |   379.99   |
|     2      |   Ritchey Timberwolf Frameset - 2016  |    5     |      6      |    2016    |   749.99   |
|     3      |    Surly Wednesday Frameset - 2016    |    8     |      6      |    2016    |   999.99   |
|     4      |        Trek Fuel EX 8 29 - 2016       |    9     |      6      |    2016    |  2899.99   |
|     5      |      Heller Shagamaw Frame - 2016     |    3     |      6      |    2016    |  1320.99   |
|     6      | Surly Ice Cream Truck Frameset - 2016 |    8     |      6      |    2016    |   469.99   |
|     7      |        Trek Slash 8 27.5 - 2016       |    9     |      6      |    2016    |  3999.99   |
|     8      | Trek Remedy 29 Carbon Frameset - 2016 |    9     |      6      |    2016    |  1799.99   |
|     9      |          Trek Conduit+ - 2016         |    9     |      5      |    2016    |  2999.99   |
|     10     |         Surly Straggler - 2016        |    8     |      4      |    2016    |  1549.00   |
+------------+---------------------------------------+----------+-------------+------------+------------+
Truncated to displaylimit of 10.

In [137]:
%%sql

SELECT p.product_name, SUM(oi.quantity * oi.list_price) AS total_revenue
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
GROUP BY p.product_name
ORDER BY total_revenue DESC
LIMIT 5;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

5 rows affected.

+-------------------------------+---------------+
|          product_name         | total_revenue |
+-------------------------------+---------------+
|    Trek Slash 8 27.5 - 2016   |   615998.46   |
|      Trek Conduit+ - 2016     |   434998.55   |
|    Trek Fuel EX 8 29 - 2016   |   414698.57   |
|  Surly Straggler 650b - 2016  |   253829.49   |
| Trek Domane SLR 6 Disc - 2017 |   236499.57   |
+-------------------------------+---------------+

### Task 2: Find the Customers Who Placed the Most Orders in June, November 2018

In [138]:
%%sql

select c.first_name, c.last_name, COUNT(o.order_id) AS total_orders
From customers c
join orders o ON c.customer_id = o.customer_id
WHERE YEAR(o.order_date) = 2018 AND MONTH(o.order_date) IN (6, 11)
GROUP BY c.first_name, c.last_name;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

3 rows affected.

+------------+-----------+--------------+
| first_name | last_name | total_orders |
+------------+-----------+--------------+
|   Debra    |   Burks   |      1       |
|  Latasha   |    Hays   |      1       |
|  Dorthey   |  Jackson  |      1       |
+------------+-----------+--------------+

### Task 3: List All Stores with Their Total Stock Quantities for All Products

In [139]:
%%sql
   
SELECT s.store_id , s.store_name , SUM(st.quantity) AS total_stock
FROM stores s
JOIN stocks st ON s.store_id = st.store_id
GROUP BY s.store_id, s.store_name;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

3 rows affected.

+----------+------------------+-------------+
| store_id |    store_name    | total_stock |
+----------+------------------+-------------+
|    1     | Santa Cruz Bikes |     4532    |
|    2     |  Baldwin Bikes   |     4359    |
|    3     |  Rowlett Bikes   |     4620    |
+----------+------------------+-------------+

### Task 4: Retrieve Staff Members Who Work at Stores Located in a Specific State
California (CA) , New York (NY) , Texas (TX)

In [77]:
%%sql
select * From stores

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

3 rows affected.

+----------+------------------+----------------+----------------------+---------------------+------------+-------+----------+
| store_id |    store_name    |     phone      |        email         |        street       |    city    | state | zip_code |
+----------+------------------+----------------+----------------------+---------------------+------------+-------+----------+
|    1     | Santa Cruz Bikes | (831) 476-4321 | santacruz@bikes.shop |  3700 Portola Drive | Santa Cruz |   CA  |  95060   |
|    2     |  Baldwin Bikes   | (516) 379-8888 |  baldwin@bikes.shop  |  4200 Chestnut Lane |  Baldwin   |   NY  |  11432   |
|    3     |  Rowlett Bikes   | (972) 530-5555 |  rowlett@bikes.shop  | 8000 Fairway Avenue |  Rowlett   |   TX  |  75088   |
+----------+------------------+----------------+----------------------+---------------------+------------+-------+----------+

In [141]:
%%sql
SELECT st.staff_id,st.first_name,st.last_name,s.store_name,s.state
FROM staffs st
JOIN stores s ON st.store_id = s.store_id
WHERE s.state IN ('CA', 'NY', 'TX');

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

10 rows affected.

+----------+------------+-----------+------------------+-------+
| staff_id | first_name | last_name |    store_name    | state |
+----------+------------+-----------+------------------+-------+
|    1     |  Fabiola   |  Jackson  | Santa Cruz Bikes |   CA  |
|    2     |   Mireya   |  Copeland | Santa Cruz Bikes |   CA  |
|    3     |   Genna    |  Serrano  | Santa Cruz Bikes |   CA  |
|    4     |   Virgie   |  Wiggins  | Santa Cruz Bikes |   CA  |
|    5     |  Jannette  |   David   |  Baldwin Bikes   |   NY  |
|    6     | Marcelene  |   Boyer   |  Baldwin Bikes   |   NY  |
|    7     |   Venita   |   Daniel  |  Baldwin Bikes   |   NY  |
|    8     |    Kali    |   Vargas  |  Rowlett Bikes   |   TX  |
|    9     |   Layla    |  Terrell  |  Rowlett Bikes   |   TX  |
|    10    | Bernardine |  Houston  |  Rowlett Bikes   |   TX  |
+----------+------------+-----------+------------------+-------+
Truncated to displaylimit of 10.

### Task 5: Identify the Categories of Products with the Highest Total Revenue

In [143]:
%%sql
     

SELECT c.category_name , SUM(oi.quantity * oi.list_price) AS total_revenue
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
JOIN categories c ON p.category_id = c.category_id
GROUP BY c.category_name
ORDER BY total_revenue DESC;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

7 rows affected.

+---------------------+---------------+
|    category_name    | total_revenue |
+---------------------+---------------+
|    Mountain Bikes   |   3030775.71  |
|      Road Bikes     |   1852555.60  |
|  Cruisers Bicycles  |   1109151.04  |
|    Electric Bikes   |   1020236.85  |
| Cyclocross Bicycles |   799874.60   |
|   Comfort Bicycles  |   438506.87   |
|  Children Bicycles  |   327888.21   |
+---------------------+---------------+

---
## Level 4: Expert â€“ Advanced Analytical Queries
(using Pandas read_sql)

### Task 1: Find the Store with the Highest Total Revenue
Retrieve the store name and total revenue (sum of list_price * quantity) across all orders.

In [146]:
%%sql

SELECT s.store_name , SUM(oi.quantity * oi.list_price) AS revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN stores s ON o.store_id = s.store_id
GROUP BY s.store_name
ORDER BY revenue DESC;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

3 rows affected.

+------------------+------------+
|    store_name    |  revenue   |
+------------------+------------+
|  Baldwin Bikes   | 5826242.21 |
| Santa Cruz Bikes | 1790145.91 |
|  Rowlett Bikes   | 962600.76  |
+------------------+------------+

### Task 2: Find all products that have never been ordered.

In [ ]:
%%sql

SELECT p.product_id , p.product_name
FROM products p
LEFT JOIN order_items oi ON p.product_id = oi.product_id
WHERE oi.product_id IS NULL;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

14 rows affected.

+------------+------------------------------------------------+
| product_id |                  product_name                  |
+------------+------------------------------------------------+
|     1      |                Trek 820 - 2016                 |
|    121     |         Surly Krampus Frameset - 2018          |
|    125     |          Trek Kids' Dual Sport - 2018          |
|    154     |     Trek Domane SLR 6 Disc Women's - 2018      |
|    195     |      Electra Townie Go! 8i Ladies' - 2018      |
|    267     |        Trek Precaliber 12 Girl's - 2018        |
|    284     |  Electra Savannah 1 (20-inch) - Girl's - 2018  |
|    291     | Electra Sweet Ride 1 (20-inch) - Girl's - 2018 |
|    316     |      Trek Checkpoint ALR 4 Women's - 2019      |
|    317     |          Trek Checkpoint ALR 5 - 2019          |
+------------+------------------------------------------------+
Truncated to displaylimit of 10.

### Task 3: Identify the Customers Who Placed the Fewest Orders
Retrieve customer names and their total order counts, ordered in ascending order of order count.

In [151]:
%%sql
SELECT c.first_name , c.last_name , COUNT(o.order_id) AS total_orders
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.first_name, c.last_name
ORDER BY total_orders ASC;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

1444 rows affected.

+------------+------------+--------------+
| first_name | last_name  | total_orders |
+------------+------------+--------------+
|  Letitia   |   Franco   |      1       |
|  Floretta  |  Higgins   |      1       |
|   Violet   | Valenzuela |      1       |
|   Carie    |    Kidd    |      1       |
|   Kellie   |   Franco   |      1       |
|  Nichelle  |   Howell   |      1       |
|  Marisol   |  Goodman   |      1       |
|   Sylvie   | Wilkerson  |      1       |
|   Marget   |   Hodge    |      1       |
|    Raul    |  Melendez  |      1       |
+------------+------------+--------------+
Truncated to displaylimit of 10.

### Task 4: Analyze Monthly Revenue for the Last Year (Specific to 2017)

In [152]:
%%sql

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

### Task 5: Find Products That Are Low in Stock Across All Stores
Identify products where the total stock quantity (across all stores) is less than 100.

In [155]:
%%sql

SELECT p.product_id , p.product_name , SUM(s.quantity) AS TotalStock
FROM products p
JOIN stocks s ON p.product_id = s.product_id
GROUP BY p.product_id, p.product_name
HAVING SUM(s.quantity) < 100
ORDER BY TotalStock DESC ;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

313 rows affected.

+------------+-------------------------------------------+------------+
| product_id |                product_name               | TotalStock |
+------------+-------------------------------------------+------------+
|    188     |         Trek XM700+ Lowstep - 2018        |     86     |
|     64     |     Electra Townie Original 7D - 2017     |     82     |
|    109     |    Sun Bicycles Cruz 7 - Women's - 2017   |     79     |
|    196     |             Trek Verve+ - 2018            |     79     |
|     61     |       Trek Powerfly 8 FS Plus - 2017      |     78     |
|    166     |      Trek Domane AL 2 Women's - 2018      |     77     |
|    182     |        Trek Domane SL 5 Disc - 2018       |     77     |
|    142     |        Trek Fuel EX 8 29 XT - 2018        |     75     |
|    219     |           Electra Moto 3i - 2018          |     75     |
|    252     | Electra Townie Commute Go! Ladies' - 2018 |     75     |
+------------+-------------------------------------------+------------+
Truncated to displaylimit of 10.


---

## Level 5: Additional Advanced SQL
(using Pandas read_sql)

### Task 1: Aggregate Sales by City and State
Write a query to calculate the total sales, average order value, and maximum order value for customers in each city and state.

In [118]:
%%sql

SELECT c.city,c.state,
SUM(oi.quantity * oi.list_price) AS total_sales,
AVG(oi.quantity * oi.list_price) AS avg_order_value,
MAX(oi.quantity * oi.list_price) AS max_order_value
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
JOIN order_items oi ON o.order_id = oi.order_id
GROUP BY c.city, c.state
ORDER BY total_sales DESC;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

195 rows affected.

+----------------+-------+-------------+-----------------+-----------------+
|      city      | state | total_sales | avg_order_value | max_order_value |
+----------------+-------+-------------+-----------------+-----------------+
|  Mount Vernon  |   NY  |  117010.21  |   1950.170167   |     9999.98     |
|  Ballston Spa  |   NY  |  110065.34  |   2116.641154   |     11999.98    |
|   San Angelo   |   TX  |  109729.26  |   2070.363396   |     10999.98    |
| Baldwinsville  |   NY  |  105893.45  |   2861.985135   |     12999.98    |
|  Howard Beach  |   NY  |  104250.51  |   2895.847500   |     23999.98    |
|  Orchard Park  |   NY  |  101189.27  |   2108.109792   |     10999.98    |
| Canyon Country |   CA  |   96243.47  |   2187.351591   |     7999.98     |
|     Monroe     |   NY  |   93938.34  |   2134.962273   |     23999.98    |
|    Houston     |   TX  |   90449.47  |   2055.669773   |     9999.98     |
|    Astoria     |   NY  |   89650.56  |   2801.580000   |     12999.98    |
+----------------+-------+-------------+-----------------+-----------------+
Truncated to displaylimit of 10.

### Task 2: Find Top-Selling Products in 2018
Write a query to identify the products with the highest sales volume in the year 2018.

In [156]:
%%sql

SELECT p.product_name , SUM(oi.quantity) AS total_quantity_sold
FROM order_items oi
JOIN orders o ON oi.order_id = o.order_id
JOIN products p ON oi.product_id = p.product_id
WHERE YEAR(o.order_date) = 2018
GROUP BY p.product_name
ORDER BY total_quantity_sold DESC;

Running query in 'mysql+mysqlconnector://root:***@localhost:3306/bike_1'

273 rows affected.

+---------------------------------------------+---------------------+
|                 product_name                | total_quantity_sold |
+---------------------------------------------+---------------------+
|  Electra Townie Original 21D EQ - 2017/2018 |          16         |
|      Electra Townie Original 21D - 2016     |          15         |
| Electra Townie Balloon 3i EQ Ladies' - 2018 |          14         |
|  Electra Townie Commute Go! Ladies' - 2018  |          13         |
|         Trek Girl's Kickster - 2017         |          12         |
|      Electra Townie Commute Go! - 2018      |          12         |
|        Electra Koa 3i Ladies' - 2018        |          11         |
|           Haro Shredder 20 - 2017           |          11         |
|    Strider Classic 12 Balance Bike - 2018   |          11         |
|   Electra Townie Commute 27D Ladies - 2018  |          11         |
+---------------------------------------------+---------------------+
Truncated to displaylimit of 10.

### Task 3: Calculate Month-over-Month Sales Growth
Write a query to calculate the month-over-month sales growth for the past years.

In [ ]:
# ??????????????????????????